# IsWallJoinedToTop Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..IsWallJoinedToTop Method
ExporterIFCUtils Class See Also
---
Checks if wall is joined to top.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsWallJoinedToTop(
	Wall wall
)
```

Visual Basic
---
```text
Public Shared Function IsWallJoinedToTop ( _
	wall As Wall _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsWallJoinedToTop(
	Wall^ wall
)
```

# ### Parameters
wall
    Type: Autodesk.Revit.DB..::..Wall The wall.
# ### Return Value
True if wall is joined to top, false if not.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace